{"url": "https://www.ndtv.com/business/led-by-start-ups-pe-vc-fund-inflows-double-to-usd-5-8-bn-in-feb-against-a-year-ago-report-2826547#pfrom=home-ndtv_business", "summary": "February 2021 saw 61 deals netting $1.1 billion.\n\nStart-ups got as much as 44 per cent of all PE/VC investments in the reporting month.\n\nPE/VC exits recorded $1.4 billion across 10 deals, primarily driven by secondary deals, including the $800-million exit from IGT Solutions by Aion.\n\nAs the volatility in the mid-cap and small-cap indices continued in the month, there was only one PE-backed IPO, and it is expected that the number of PE-backed IPOs will be lower in 2022 given the volatility, rise in uncertainty and waning investor interest in the primary markets, according to the report.\n\nWhile the technology sector continued to receive maximum investments in 2022, there has been a significant rise in investments into the fintech segment led by the emerging decentralised finance space.\n\nFintech investments have grown at an annualised rate of 125 per cent over the past five years, primarily driven by investments into the payments ecosystem with neo-banking and decentralised finance spaces recording 20 times growth.\n\nThe month saw 17 deals greater than or equal to $100 million aggregate to $4.4 billion, compared with $1.6 billion across 10 deals in February 2021 and 14 deals worth $3 billion in January.\n\nBaring PE Asia's largest deal bought IGT Solutions from Aion for over $800 million.\n\nThe month saw a total fundraise of $347 million across four funds compared with one fund's $380 million in February 2021. Led by start-ups, PE/ VC fund inflows double to $5.8 billion: Report\n\nRecord fund inflows through private equity (PE) and venture capital (VC) funds, primarily into the start-up ecosystem, have propelled the overall inflows to $5.8 billion in February, which is double the amounts annualised, according to industry data.\n\nAccording to the monthly data tabulated by the IVCA-EY (Indian Venture and Alternate Capital Association), PE/VC fund inflows in February jumped to $5.8 billion, 2.3 times more than what was seen in February 2021 at $2.5 billion.\n\nDeal volume grew 33 per cent to 117 deals, but this is four per cent lower than January when it stood at 122 deals.\n\nAs much as 88 per cent of the total PE/VC investments in February were pure-play investments, excluding real estate and infrastructure sectors, compared with 79 per cent last February.\n\nThe deal space was led by 17 large deals worth $4.4 billion and 24 per cent monthly. Nearly half of the total investments, or $2.5 billion, flew into start-ups, making it the highest value in the month across 85 deals.\n\nWhile buyouts saw $1.5 billion across seven deals during the month, exits stood at $1.4 billion across 10 deals, including three secondary exits worth $1.2 billion.\n\nFebruary inflows of $5.8 billion from PE/VC are more than double the investments a year ago and 24 per cent higher than the previous month. Pure-play PE/VC investments, excluding infrastructure and realty, and start-ups continued to dominate the investment landscape accounting for 88 per cent and 44 per cent of the total inflows in value terms, respectively"}