{"url": "https://indianexpress.com/article/explained/koo-voluntary-self-verification-explained-7858048/", "summary": "Critics have also said that authenticating users may not curb misinformation since there have been instances where verified accounts on social media platforms have disseminated misinformation.\n\nWhat do Indian laws say about verification of social media users?\n\nAccording to the IT Rules that kicked in last year, significant social media intermediaries — those having more than 5 million users in India — should enable Indian users to “voluntarily” verify their accounts using “any appropriate mechanism”, including their mobile numbers.\n\nWith its latest move, Koo has moved to become the first significant social media intermediary to adhere to this requirement under the IT Rules.\n\nThere is currently no law that requires social media platforms to mandatorily verify their users, as clarified by Minister of State for Electronics and IT Rajeev Chandrashekhar in Parliament last month. Microblogging platform and Twitter homegrown rival in India, Koo has launched voluntary self-verification, where users can add their Aadhaar details to authenticate their accounts on the platform, a requirement under India’s intermediary liability rules.\n\nThe company’s move comes amid debates around verifying the identity of users on social media platforms and if that could potentially curb misinformation and ensure accountability of third-party content on such platforms.\n\nMust read | Koo wants to be the largest opinion platform of the world without an opinion of our own: Founder\n\nHow will Koo’s self-verification work?\n\nSelf-verification is currently only voluntary; users are not required to mandatorily go through it as the company said it has launched the feature on a “best efforts” basis.\n\n“The feature is available only to Indian nationals who have an Indian phone number linked to their Aadhaar number/government ID,” Koo said. The company said it will not store any Aadhaar data related to the process of self-verification, and will only record if an Aadhaar number submitted for verification is validated or rejected by the Unique Identification Authority of India (UIDAI), the Aadhaar agency.\n\nIt also said it will not display the name or Aadhaar number of a user unless the user chooses to do so. It did not respond to a query seeking clarification on who the “government-approved third-parties” are.\n\nAt the moment, Koo’s app seems to only be accepting users’ Aadhaar numbers as valid government IDs. (Image credit: Koo screenshot)\n\nWhat does this mean for users?\n\nVerifying a user could lend credibility and authenticity to their account and the content they share, ascertain a person’s identity in case they post unlawful content online, and reduce the threat of impersonation.\n\nOn the other hand, critics have raised concerns that verifying users may pose a hurdle for those who may want to remain anonymous on the internet. The company said the validation of Aadhaar details submitted by a user would be carried out by “government-authorised third-parties”. Only a visible tick will be shown next to a user’s name who has successfully completed self-verification.\n\nKoo is adding a self-verification option. (Image credit: Koo screenshot) Koo is adding a self-verification option"}