{"url": "https://www.ndtv.com/business/how-jack-dorsey-evolved-from-his-love-for-twitter-to-join-bitcoin-club-2887048#pfrom=home-ndtv_cryptocurrency", "summary": "Although Dorsey can be cryptic—the day before he resigned as CEO, he posted “I love twitter” without any other context—his missives typically offer a glimpse into what's on his mind.\n\nJudging by this, Dorsey's interest in Bitcoin took off after a monthlong trip to Africa in November 2019, after which he started tweeting about the currency nonstop. Last year, at a different crypto event alongside Elon Musk, Dorsey said he believed Bitcoin could bring about “world peace.” (Musk, the world's richest person, became Twitter's largest shareholder in March, deepening an alliance with Dorsey that has developed over several years.) During his dinner with Portnoy, Dorsey told him he wanted to focus exclusively on the digital currency. While he was running both Twitter and Square, his employees often joked that Twitter was his “favorite child.” Now it appears—based on conversations with more than 30 current and former employees who've worked for him—the favorite child isn't so much Block; it's Bitcoin.\n\nnot sure anyone has heard but,\n\n\n\nI resigned from Twitter pic.twitter.com/G5tUkSSxkl — jack⚡️ (@jack) November 29, 2021\n\nOver the past two years, Dorsey, who declined to comment through a spokesperson, has fashioned himself as the currency's unofficial spiritual leader and public defender, promoting it constantly from his Twitter feed and taking swipes at tech's venture capitalists who are funding rival crypto projects. “If you like directions,” says one former Block employee, “you will struggle with Jack.”\n\nDorsey's aversion to making decisions was why, for instance, Twitter spent years working on minuscule product tweaks, such as increasing the maximum tweet length to 280 characters. In discussions with investors before its 2015 IPO, Block executives referred to a diagram showing Disney's offerings including theatrical films, merchandising, and theme parks. It was Dorsey's turn for “storytime,” a weekly video call where Twitter's senior executives took turns reading children's books to staff and their kids.\n\nTo those on the call, the moment summed up Dorsey perfectly. But Dorsey has argued for a business rationale in which Block will create better ways for musicians to get paid, much like Square did for coffee shops and farmers market vendors in its early days.\n\nI'm grateful for Jay's vision, wisdom, and leadership. election in November 2020, Twitter issued a filing that said the board had reviewed the company's management structure and “expressed its confidence in management.” This was code for “Jack can keep his job.”\n\nThe stock price reached an all-time high in late February 2021, but two months later Twitter reported poor quarterly earnings, the beginning of an up-and-down year. As he put it at the B Word conference in July 2021, “You see a chance to replace the whole foundation.”\n\nAfter Elliott's initial attack on Dorsey in early 2020, Twitter had a pretty good year. The company had viewed Twitter as a ripe target for years, partly because its business had underwhelmed, and partly because Twitter, unlike Google and Facebook, hadn't given its founders so-called supervoting shares that would've allowed them to control the company"}